In [78]:
import pyodbc 
import pandas as pd
import re

In [79]:
conn = pyodbc.connect('Driver={SQL Server};'  'Server=DESKTOP-74QIRVG;' 'Database=GenesysCore;' 'Trusted_Connection=yes;')

In [80]:
tables=pd.read_sql_query('SELECT Name,LastName,FirstName,BusinessPhone FROM Contacts',conn)

In [81]:
Name = tables['Name'].to_string() 
LastName= tables['LastName'].to_string() 
FirstName = tables['FirstName'].to_string() 
Phone = tables['BusinessPhone'].to_string() 
newphone= tables['BusinessPhone'].str[-10:]

In [82]:
tables['BusinessPhone']=tables['BusinessPhone'].str.replace('^(-|\+)353','').astype(str)
tables['BusinessPhone']=tables['BusinessPhone'].str.replace('^00','').astype(str)

In [83]:
tables.head(10)

                                   Name    LastName  FirstName BusinessPhone
0                             I.T TOPAZ    Helpdesk  I.T TOPAZ      12028787
1                        Complaints ROI   Middleton    Stephen     873516601
2                         Complaints NI      Manger      Steve  447774554360
3                Finance Escalations NI  O'Flaherty      Cian       12028808
4               Finance Escalations ROI     Kearney    Colette      12028765
5         Transport/Delivery Escalation  McLoughlin    Charlie  442890553808
6         Transport/Delivery Escalation       Black     Seamus  447917895887
7         Transport/Delivery Escalation      Bailie      Terry  442890553811
8  Commercial Escalation/Complaints ROI       Smith   Caroline     469099611
9   Commercial Escalation/Complaints NI     Chesney       Mark  442891812608

In [84]:
cursor = conn.cursor()

In [85]:
cursor.execute('CREATE TABLE GenesysCore.dbo.NEWDEMO (Name varchar(230), LastName varchar(200), FirstName varchar(200), BusinessPhone nvarchar(50))')

In [86]:
for index,row in tables.iterrows():
    cursor.execute("INSERT INTO GenesysCore.dbo.NEWDEMO([Name],[LastName],[FirstName],[BusinessPhone]) values (?, ?,?,?)", row['Name'], row['LastName'] , row['FirstName'],row['BusinessPhone']) 
    conn.commit()

In [87]:
cursor.close()
conn.close()

In [88]:
pwd()

'C:\\Program Files\\Microsoft SQL Server\\MSSQL14.MSSQLSERVER\\PYTHON_SERVICES'